cfd/cases/full_closed_U01/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}

scale 1;
vertices
(
    (-0.8147 -0.4204 -0.4266)
    (0.5290 -0.4204 -0.4266)
    (0.5290 0.4204 -0.4266)
    (-0.8147 0.4204 -0.4266)
    (-0.8147 -0.4204 0.1210)
    (0.5290 -0.4204 0.1210)
    (0.5290 0.4204 0.1210)
    (-0.8147 0.4204 0.1210)
);
blocks ( hex (0 1 2 3 4 5 6 7) (84 53 34) simpleGrading (1 1 1) );
edges ();
boundary
(
    inlet      { type patch; faces ((1 2 6 5)); }    // +x 端（艏前方）：来流从这里吹向 -x
    outlet     { type patch; faces ((0 4 7 3)); }    // -x 端（艉后方）
    sides      { type patch; faces ((0 1 5 4) (3 7 6 2)); }
    bottom     { type patch; faces ((0 3 2 1)); }
    atmosphere { type patch; faces ((4 5 6 7)); }
);
mergePatchPairs ();
