cfd/cases/full_closed_U01/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}

simulationType RAS;
RAS { RASModel kOmegaSST; turbulence on; printCoeffs on; }
