cfd/cases/full_closed_U01/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}

phases (water air);
water { transportModel Newtonian; nu 1.09e-06; rho 998.8; }
air   { transportModel Newtonian; nu 1.48e-05; rho 1; }
sigma           0.07;
