cfd/cases/full_closed_U01/0.orig/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}

dimensions [0 2 -1 0 0 0 0];
internalField uniform 0;
boundaryField
{
    ".*" { type calculated; value uniform 0; }
    overset_FL { type overset; }
    overset_FR { type overset; }
    overset_RL { type overset; }
    overset_RR { type overset; }
    "(paddle_.*|hull)" { type nutkWallFunction; value uniform 0; }
}
