cfd/cases/full_closed_U01/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

solvers
{
    "cellDisplacement.*" { solver PCG; preconditioner DIC; tolerance 1e-06; relTol 0; maxIter 300; }
    "alpha.water.*"
    {
        nAlphaCorr      3;
        nAlphaSubCycles 2;
        cAlpha          1;
        icAlpha         0;
        MULESCorr       yes;
        nLimiterIter    5;
        alphaApplyPrevCorr no;
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }
    "pcorr.*"   { solver PCG; preconditioner DIC; tolerance 1e-9; relTol 0; }
    p_rgh       { solver PBiCGStab; preconditioner DILU; tolerance 1e-8; relTol 0.01; }
    p_rghFinal  { $p_rgh; relTol 0; }
    "(U|k|omega).*" { solver smoothSolver; smoother symGaussSeidel; tolerance 1e-8; relTol 0; }
}
PIMPLE
{
    momentumPredictor   no;
    nOuterCorrectors    1;
    nCorrectors         3;
    nNonOrthogonalCorrectors 0;
    ddtCorr             yes;
    correctPhi          no;
    massFluxInterpolation no;
    moveMeshOuterCorrectors no;
    turbOnFinalIterOnly no;
    oversetAdjustPhi    no;
    checkMeshCourantNo  yes;
}
relaxationFactors { equations { ".*" 1; } }
cache { grad(U); }
