cfd/cases/full_closed_U01/system/topoSetDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}

actions
(
    { name c0; type cellSet; action new; source boxToCell; box (-100 -100 -100) (100 100 100); }
    { name c0; type cellZoneSet; action new; source setToCellZone; set c0; }
);
